app/controllers/admin/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses` ORDER BY level_id, order_num

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 4) ORDER BY level_id, order_num LIMIT 1

  def new
    @course = Course.new
    @targets = Target.find(:all)
    @levels = Level.find(:all)
    @level_count = Course.count(:conditions => "level_id = '#{@course.level_id}'") + 1
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `courses` WHERE (level_id = '')) AS subquery
SELECT `levels`.* FROM `levels`

  def edit
    @course = Course.find(params[:id])
    @targets = Target.find(:all)
    @levels = Level.find(:all)
    @level_count = Course.count(:conditions => "level_id = '#{@course.level_id}'") + 1
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 6) ORDER BY level_id, order_num LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `courses` WHERE (level_id = '1')) AS subquery
SELECT `levels`.* FROM `levels`

  def level_count

    @level_count = Course.count(:conditions => "level_id = '#{params[:level_id]}'") + 1
---
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM `courses` WHERE (level_id = '3')) AS subquery

  def update
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 6) ORDER BY level_id, order_num LIMIT 1

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1
DELETE FROM `courses` WHERE (`courses`.`id` = 1)