app/controllers/admin/exercises_controller.rb

SELECT `exercises`.* FROM `exercises` ORDER BY order_num
---
  def index
    @exercises = Exercise.all()

SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`id` = 5) ORDER BY order_num LIMIT 1
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT COUNT(*) AS count_id FROM `exercises`
---
  def new
    @exercise = Exercise.new
    @order_count = Exercise.count() + 1

SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`id` = 5) ORDER BY order_num LIMIT 1
SELECT COUNT(*) AS count_id FROM `exercises`
SELECT * FROM `courses` INNER JOIN `courses_exercises` ON `courses`.id = `courses_exercises`.course_id WHERE (`courses_exercises`.exercise_id = 6 ) ORDER BY level_id, order_num
SELECT `prerequisites`.* FROM `prerequisites` WHERE (`prerequisites`.exercise_id = 6)
---
  def edit
    @exercise = Exercise.find(params[:id])
    #RAILS_DEFAULT_LOGGER.debug c(@exercise.methods.sort.inspect)
    #RAILS_DEFAULT_LOGGER.debug c(@exercise.prerequisites.inspect)
    @order_count = Exercise.count()
    @order_options = [['Choose One',0]]
    for i in 1..@order_count
      @order_options << [i,i]
    end
    @prereq_course_ids = @exercise.prerequisites.collect{|pre| pre.course_id}

INSERT INTO `exercises` (`created_at`, `description`, `order_num`, `title`, `updated_at`) VALUES ('2011-01-10 20:39:08', 'test 1', 1, 'test 1', '2011-01-10 20:39:08')
---
  def create
    @exercise = Exercise.new(params[:exercise])
    ActiveRecord::Base.connection.execute "update exercises set order_num = order_num + 1 where order_num >= '#{params[:exercise][:order_num]}'"

    respond_to do |format|
      if @exercise.save

SELECT `prerequisites`.* FROM `prerequisites` WHERE (`prerequisites`.exercise_id = 6)
SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`id` = 5) ORDER BY order_num LIMIT 1
---
  def update
    puts params[:exercise]["courses"].inspect
    new_prerequisites = params[:exercise]["prerequisites_attributes"].collect{|ind,course| Prerequisite.new({:course_id => course["course_id"].to_i, :exercise_id => params[:id]})  unless course["course_id"] == ""}.compact!
    params[:exercise]["prerequisites_attributes"] = []
    @exercise = Exercise.find(params[:id])

SELECT `exercises`.* FROM `exercises` WHERE (`exercises`.`id` = 1) LIMIT 1
DELETE FROM `exercises` WHERE (`exercises`.`id` = 1)
---
  def destroy
    @exercise = Exercise.find(params[:id])
    @exercise.destroy