app/controllers/admin/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT `levels`.* FROM `levels`

  def show
    @level = Level.find(params[:id])
---
SELECT `levels`.* FROM `levels` WHERE (`levels`.`id` = 1) LIMIT 1

  def edit
    @level = Level.find(params[:id])
---
SELECT `levels`.* FROM `levels` WHERE (`levels`.`id` = 1) LIMIT 1

  def create
    @level = Level.new(params[:level])

    respond_to do |format|
      if @level.save
---
INSERT INTO `levels` (`created_at`, `name`, `updated_at`) VALUES ('2011-01-05 20:34:33', 'Beginning', '2011-01-05 20:34:33')

  def update
    @level = Level.find(params[:id])

    respond_to do |format|
      if @level.update_attributes(params[:level])
---
SELECT `levels`.* FROM `levels` WHERE (`levels`.`id` = 1) LIMIT 1
UPDATE `levels` SET `name` = 'Beginner', `updated_at` = '2011-01-05 20:34:40' WHERE (`levels`.`id` = 1)