app/controllers/admin/resources_controller.rb

SELECT `resources`.* FROM `resources` WHERE (`resources`.`course_id` IS NULL) LIMIT 1
---
  def index
    @admin_resources = Resource.find_all_by_course_id(params[:course_id])

SELECT `resources`.* FROM `resources` WHERE (`resources`.`id` = 2) LIMIT 1
---
  def show
    @admin_resource = Resource.find(params[:id])

SELECT `resources`.* FROM `resources` WHERE (`resources`.`id` = 2) LIMIT 1
---
  def edit
    @admin_resource = Resource.find(params[:id])

INSERT INTO `resources` (`course_id`, `created_at`, `updated_at`, `url`) VALUES (NULL, '2011-01-10 17:50:52', '2011-01-10 17:50:52', NULL)
---
  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save

SELECT `resources`.* FROM `resources` WHERE (`resources`.`id` = 2) LIMIT 1
UPDATE `resources` SET `updated_at` = '2011-01-10 19:03:23', `url` = 'http://www.punkgrock.com/courses/98' WHERE (`resources`.`id` = 6)
---
  def update
    @admin_resource = Resource.find(params[:id])

    respond_to do |format|
      if @admin_resource.update_attributes(params[:resource])

SELECT `resources`.* FROM `resources` WHERE (`resources`.`id` = 2) LIMIT 1
DELETE FROM `resources` WHERE (`resources`.`id` = 2)
---
  def destroy
    puts "got here"
    @admin_resource = Resource.find(params[:id])
    @admin_resource.destroy