app/controllers/admin/targets_controller.rb

  def index
    @targets = Target.all
---
SELECT `targets`.* FROM `targets`

  def show
    @target = Target.find(params[:id])
---
SELECT `targets`.* FROM `targets` WHERE (`targets`.`id` = 1) LIMIT 1

  def create
    @target = Target.new(params[:target])

    respond_to do |format|
      if @target.save
---
INSERT INTO `targets` (`created_at`, `name`, `updated_at`) VALUES ('2011-01-05 20:35:29', 'Frontend', '2011-01-05 20:35:29')