app/controllers/admin/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE (`users`.`id` = 1)