app/views/admin/exercises/_form.html.erb

SELECT * FROM `courses` INNER JOIN `courses_exercises` ON `courses`.id = `courses_exercises`.course_id WHERE (`courses_exercises`.exercise_id = 6 ) ORDER BY level_id, order_num
---
  <div class="field">
    <!-- maybe try doing fields.courses.all and then see what fields gives ya. -->