app/views/admin/reports/users.html.erb

SELECT COUNT(*) AS count_id FROM `exercises`
---
    <td><%= user.known_expert.length %>/<%= @total_expert %></td>
    <td><%= user.finished_exercises.collect{|fe| fe if fe.finished}.compact.length %>/<%= @total_exercises %></td>