app/views/courses/index.html.erb

  <% @courses.each do |course| %>
    <% answer = course.courses_users.collect{|course_user| course_user.know unless course_user.user.id != @current_user.id }.compact.first %>
---
SELECT `courses`.* FROM `courses` ORDER BY level_id, order_num
SELECT `users`.* FROM `users` INNER JOIN `courses_users` ON `users`.id = `courses_users`.user_id WHERE ((`courses_users`.course_id = 2))

      <tr>
        <th colspan="2" class="level_header"><h3><%= @levels.collect{|level| level.name unless level.id != course.level_id}.compact.first %></h3></td>
---
SELECT `levels`.* FROM `levels`