app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses` ORDER BY level_id, order_num
---
  def welcome
    @courses = Course.all

SELECT `courses`.* FROM `courses` ORDER BY level_id, order_num
SELECT `levels`.* FROM `levels`
---
  def index
    @courses = Course.all
    @levels = Level.all

SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1
---
  def show
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 1) LIMIT 1
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`created_at`, `level_id`, `name`, `target_id`, `updated_at`) VALUES ('2011-01-05 20:23:44', 0, 'test', 0, '2011-01-05 20:23:44')
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save