app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all()
    @finished_exercises = FinishedExercise.select('exercise_id').where(:user_id => @current_user.id, :finished => 1).collect{|exercise| exercise.exercise_id }
---
SELECT `exercises`.* FROM `exercises` ORDER BY order_num
SELECT exercise_id FROM `finished_exercises` WHERE (`finished_exercises`.`user_id` = 4) AND (`finished_exercises`.`finished` = 1)