app/controllers/resources_controller.rb

  def index
    @resources = Resource.find_all_by_course_id(params[:course_id])

    @resources = [] unless !@resources.nil?
    @course = Course.find_by_id(params[:course_id])
---
SELECT `resources`.* FROM `resources` WHERE (`resources`.`course_id` = 2) LIMIT 1
SELECT `courses`.* FROM `courses` WHERE (`courses`.`id` = 2) ORDER BY level_id, order_num LIMIT 1