app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`username` = 'scott_cs') LIMIT 1
INSERT INTO `users` (`admin`, `created_at`, `image`, `oauth_secret`, `oauth_token`, `updated_at`, `username`) VALUES (NULL, '2011-01-05 21:17:52', 'http://a0.twimg.com/profile_images/557277787/P3110048_low_normal.jpg', 'poql6d3ftlpOl4tFjgYB1CZR2b9UgGYmkwyQoAIfk', '94118310-xFAxpyaNqGnmIBhbmEzuCzcxZllpV1hLYjDkuJIXU', '2011-01-05 21:17:52', 'scott_cs')
---
  def authenticate
    RAILS_DEFAULT_LOGGER.info c("\n\ndo 1\n\n")
    puts TWITTER_CONSUMER_KEY.inspect
    client = TwitterOAuth::Client.new(
        :consumer_key => TWITTER_CONSUMER_KEY,
        :consumer_secret => TWITTER_CONSUMER_SECRET
    )
    #Dump::var("client",client.inspect)
    puts client.inspect
    puts session[:request_token].params[:oauth_token].inspect
    RAILS_DEFAULT_LOGGER.info c("\n\ndo 2\n\n")
    access_token = client.authorize(
      session[:request_token].params[:oauth_token],
      session[:request_token].params[:oauth_token_secret],
      :oauth_verifier => params[:oauth_verifier]
    )

    puts 'token ' + access_token.inspect

    RAILS_DEFAULT_LOGGER.info c("\n\ndo 3\n\n")
    if client.authorized?
      RAILS_DEFAULT_LOGGER.info c("\n\nclient.user -- #{client.user.inspect}\n\n")
      user = User.find_by_username(client.user.first['user']['screen_name'])
      if user.nil?
        user = User.create(:username => client.user.first['user']['screen_name'],
                    :image => client.user.first['user']['profile_image_url'],
                    :oauth_token => access_token.params[:oauth_token],
                    :oauth_secret => access_token.params[:oauth_token_secret])