app/views/exercises/index.html.erb

          You must complete the following courses:&nbsp;
          <% (exercise.prerequisites.collect{|prereq| prereq.course } - @current_user.known_courses).each do |course| %>
---
SELECT `prerequisites`.* FROM `prerequisites` WHERE (`prerequisites`.exercise_id = 6)