app/views/admin/courses/_form.html.erb

SELECT `targets`.* FROM `targets`
---
    <%= f.label :target_id %><br />
    <%= f.select :target_id, options_for_select(@targets.collect{|t| [t.name,t.id]}.sort,@course.target_id) %>

SELECT `levels`.* FROM `levels`
---
    <%= f.label :level_id %><br />
    <%= f.select :level_id, options_for_select([['Choose One',0]] + (@levels.collect{|l| [l.name,l.id]}.sort),@course.level_id) %>